app/Controllers/LabController.php


        $detailsModel = new LabtestdetailsModel();
        foreach ($tests as $test) {
            $detailsModel->insert([
                'labTestID' => $labtestId,
                'testTypeID' => $test['testTypeId'],
                'fee' => $test['fee'],
            ]);
---
INSERT INTO `labtestdetails` (`labTestID`, `testTypeID`, `fee`) VALUES (179, '2', '10')