app/Controllers/LoginController.php

    public function save_user()
    {
        $request = \Config\Services::request();
        $session = \Config\Services::session();

        $nicImage = $request->getFile('cnic_image');
        $email = $request->getPost('user_email');
        $userModel = new LoginModel('users');
        $existingUser = $userModel->where('email', $email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'HBS@GMAIL.COM'
 LIMIT 1