app/Models/AppointmentModel.php

SELECT `appointment`.*, `client`.`client` as `clientName`, `doctorprofile`.`FirstName` as `doctorFirstName`, `doctorprofile`.`LastName` as `doctorLastName`, `fee_type`.`FeeType` as `appointmentTypeName`
FROM `appointment`
JOIN `client` ON `client`.`idClient` = `appointment`.`clientID`
JOIN `doctorprofile` ON `doctorprofile`.`DoctorID` = `appointment`.`doctorID`
JOIN `fee_type` ON `fee_type`.`f_id` = `appointment`.`appointmentType`
---
    public function getAppointments()
    {
        return $this->db->table('appointment')
            ->join('client', 'client.idClient = appointment.clientID')
            ->join('doctorprofile', 'doctorprofile.DoctorID = appointment.doctorID')
            ->join('fee_type', 'fee_type.f_id = appointment.appointmentType')
            ->select('appointment.*, client.client as clientName, doctorprofile.FirstName as doctorFirstName, doctorprofile.LastName as doctorLastName, fee_type.FeeType as appointmentTypeName')
            ->get()
            ->getResultArray();

SELECT *
FROM `appointment`
WHERE `clientID` = '2'
---
    public function getAppointmentsForClient($clientId)
    {
        return $this->where('clientID', $clientId)->findAll();