app/Models/ClientModel.php

    public function getClientNames()
    {
        return $this->select('idClient, client')->findAll();
---
SELECT `idClient`, `client`
FROM `client`