app/Models/DoctorModel.php

SELECT *
FROM `doctorprofile`
JOIN `specialization` ON `specialization`.`s_id` = `doctorprofile`.`Specialization`
---
    public function getdoctorprofile()
{
    return $this->db->table('doctorprofile')
        ->join('specialization', 'specialization.s_id = doctorprofile.Specialization')
        ->get()
        ->getResultArray();

SELECT `f_id`, `FeeType`, `Description`
FROM `fee_type`
---
    public function getFeeTypes()
    {
        // Assuming you have a 'fee_type' table in your database
        $query = $this->db->table('fee_type')
            ->select('f_id, FeeType, Description')
            ->get()
            ->getResult();

SELECT `doctor_fee`.`df_id`, `doctorprofile`.`FirstName`, `doctorprofile`.`LastName`, `fee_type`.`FeeType`, `doctor_fee`.`Fee`
FROM `doctor_fee`
JOIN `doctorprofile` ON `doctorprofile`.`DoctorID` = `doctor_fee`.`doctorId`
JOIN `fee_type` ON `fee_type`.`f_id` = `doctor_fee`.`FeeTypeId`
---
    public function getDoctorFees()
{
    return $this->db->table('doctor_fee')
        ->join('doctorprofile', 'doctorprofile.DoctorID = doctor_fee.doctorId')
        ->join('fee_type', 'fee_type.f_id = doctor_fee.FeeTypeId')
        ->select('doctor_fee.df_id, doctorprofile.FirstName, doctorprofile.LastName, fee_type.FeeType, doctor_fee.Fee')
        ->get()
        ->getResultArray();