app/Models/LoginModel.php

    public function getBusinessData($businessID)
    {
        return $this->db->table('business')->where('ID', $businessID)->get()->getRowArray();
---
SELECT *
FROM `business`
WHERE `ID` = '39'

    public function getModules()
    {

        $query = $this->db->table('modules')->get();
---
SELECT *
FROM `modules`

    public function getuserprofile()
    {
        $session = \Config\Services::session();
        $businessID = $session->get('businessID');

        return $this->db->table('users')
        ->where('businessID', $businessID)
            ->get()
            ->getResultArray();
---
SELECT *
FROM `users`
WHERE `businessID` = '39'