app/Models/salesModel.php

    public function getpayment()
    {
        return $this->db->table('paymentmethods')
            ->select('idPaymentMethods, Method')
            ->get()
            ->getResultArray();
---
SELECT `idPaymentMethods`, `Method`
FROM `paymentmethods`

    public function getCurrancy()
    {
        return $this->db->table('currency')
            ->select('id, Currency')
            ->get()
            ->getResultArray();
---
SELECT `id`, `Currency`
FROM `currency`

    public function getServices()
    {
        return $this->db->table('artmenu')
            ->select('idArtMenu, Name, Price')
            ->get()
            ->getResultArray();
---
SELECT `idArtMenu`, `Name`, `Price`
FROM `artmenu`

    public function getCategories()
    {
        return $this->db->table('catart')
            ->select('idCatArt, name, idSector')
            ->get()
            ->getResultArray();
---
SELECT `idCatArt`, `name`, `idSector`
FROM `catart`